# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv2dNormActivation, [32, 3, 2, None, 1, nn.BatchNorm2d, nn.ReLU6]],
   [-1, 1, InvertedResidualv2, [16, 1, 1, nn.BatchNorm2d]],

   [-1, 1, InvertedResidualv2, [24, 2, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [24, 1, 6, nn.BatchNorm2d]], 

   [-1, 1, InvertedResidualv2, [32, 2, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [32, 1, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [32, 1, 6, nn.BatchNorm2d]],

   [-1, 1, InvertedResidualv2, [64, 2, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [64, 1, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [64, 1, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [64, 1, 6, nn.BatchNorm2d]],

   [-1, 1, InvertedResidualv2, [96, 1, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [96, 1, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [96, 1, 6, nn.BatchNorm2d]], # 13 P3/16

   [-1, 1, InvertedResidualv2, [160, 2, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [160, 1, 6, nn.BatchNorm2d]],
   [-1, 1, InvertedResidualv2, [160, 1, 6, nn.BatchNorm2d]], # 16 P4/32

   [-1, 1, InvertedResidualv2, [320, 1, 6, nn.BatchNorm2d]], # 17
   [-1, 1, Conv2dNormActivation, [1280, 1, 1, None, 1, nn.BatchNorm2d, nn.ReLU6]]]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 19
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 1, 'nearest']],
   [16, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 31
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [13, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]], # 36
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 43
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 31], 1, Concat, [1]], # 48
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 56
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [19, 1, MP, []],
   [[-2, -4, -1], 1, Concat, [1]],  # 62
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 70
   
   [43, 1, RepConv, [256, 3, 1]],
   [56, 1, RepConv, [512, 3, 1]],
   [70, 1, RepConv, [1024, 3, 1]],

   [[71,72,73], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
